[X2Ability_LW2WotC_PassiveAbilitySet]
LocDenseSmokeEffect="Dense Smoke"
LocDenseSmokeEffectDescription="This smoke effect was created by a unit with Dense Smoke, and grants an additional +<Ability:DENSE_SMOKE_INVERSE/> defense."
LocTrojanVirus="Trojan Virus"
LocTrojanVirusTriggered="<XGParam:StrValue0/!UnitName/> triggered Trojan Virus."

[VanillaTemplateMods]
LocCoveringFire="Covering Fire"
LocCoveringFireMalus="This unit has been targeted by an overwatching unit with the Covering Fire ability, conferring -10 to aim for the rest of the turn."